ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/agc.c
/**
***************************************************************************
* @file         agc.c
* @author       ADI
* @version      V1.0.0
* @date         10-June-2019
* @brief        Source file contains the static agc functions.
***************************************************************************
* @attention
***************************************************************************
* Copyright (c) 2021 Analog Devices, Inc.  All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
* - Redistributions of source code must retain the above copyright notice, this
*   list of conditions and the following disclaimer.
* - Redistributions in binary form must reproduce the above copyright notice,
*   this list of conditions and the following disclaimer in the documentation
*   and/or other materials provided with the distribution.
* - Modified versions of the software must be conspicuously marked as such.
* - This software is licensed solely and exclusively for use with
*   processors/products manufactured by or for Analog Devices, Inc.
* - This software may not be combined or merged with other code in any manner
*   that would cause the software to become subject to terms and conditions
*   which differ from those listed here.
* - Neither the name of Analog Devices, Inc. nor the names of its contributors
*   may be used to endorse or promote products derived from this software
*   without specific prior written permission.
* - The use of this software may or may not infringe the patent rights of one
*   or more patent holders.  This license does not release you from the
*   requirement that you obtain separate licenses from these patent holders to
*   use this software.
*
* THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
* NONINFRINGEMENT, TITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF
* CLAIMS OF INTELLECTUAL PROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
******************************************************************************/

#include <string.h>
#include "adpd400x_drv.h"
#include "adpd400x_reg.h"
#include "adpd400x_lib_common.h"
#include "agc.h"
#include "adpd4000_dcfg.h"
#include "sensor_adpd_application_interface.h"
#include <math.h>
#define MODULE ("Agc.c")

/*================== LOG LEVELS=============================================*/
#include "nrf_log.h"

/*--------------------------- Defines ----------------------------------------*/
#define INIT_AGCLED_PHASE2 0x08
#define INIT_AGCLED_PHASE1 0x0D
//Initial TIA gain 12.5k
#define INIT_TIA_GAIN_PHASE2 (0x03E4)
#define INIT_TIA_GAIN_PHASE1 (0xE3E4)

 /* 127(0x7F) -> 200mA-> Max. Current per LED Driver */
#define MAX_200MA_LED_REG_VAL 127
 /* 254 -> 400mA ->  Max. Current for all 4 LED drivers combined together */
#define MAX_400MA_LED_REG_VAL 254

/* 
Max factor by which a signal can be amplified considering 
a single LED driver enabled with max current limit of 200mA

200k [max TIA gain]/12.5k [measurement TIA gain]*(127 [max LED current]/8 [measurement LED current]) = 254
*/
#define MAX_AMP_FACTOR_200MA 254

/* 
Max factor by which a signal can be amplified considering
multiple LED drivers enabled with max current limit of 400mA

200k [max TIA gain]/12.5k [measurement TIA gain]*(254 [max LED current]/8 [measurement LED current]) = 508
*/
#define MAX_AMP_FACTOR_400MA 508

/* 5 Different values of TIA Gain
3-bits used in 0x01X4 register to specify TIA gain
for each channel in the slot
0(000) -> 200k
1(001) -> 100k
2(010) -> 50k
3(011) -> 25k
4(100) -> 12.5k
*/
#define NUM_TIA_GAINS 5
/*--------------------------- Typedef ----------------------------------------*/

/*--------------------------- Public Variable --------------------------------*/
agc_data_t agc_data[SLOT_NUM];
static uint16_t gHighestSlotActive;
static uint16_t hrmInputRate;
#ifdef STATIC_AGC
extern uint8_t agc_samples;
extern uint8_t skip_first_10_samples;
#endif
extern uint8_t dvt2;/* flag to check if phase-2 chip is used */
extern uint32_t gn_led_slot_g;
extern uint32_t gn_led_slot_r;
extern uint32_t gn_led_slot_ir;
extern uint32_t gn_led_slot_b;
extern uint32_t gn_agc_active_slots;
#ifdef ENABLE_PPG_APP
extern uint32_t  Ppg_Slot;
#endif
/*--------------------------- Public Function Prototype --------------------- */

/*--------------------------- Private variables ------------------------------*/

typedef struct SlotRegister {
  uint16_t pulse[SLOT_NUM];
}SlotRegisters_t;

static uint16_t g_agc_reg_base;
static uint16_t Init_gain = INIT_TIA_GAIN_PHASE2;
//LED full scale calculation with no of pulses
uint32_t FullScale[SLOT_NUM]={0};
static SlotRegisters_t SlotRegisters;
//DC level calculation for TIA gain 12.5_25_50_100_200k
agc_DC_level_cal_t DC0_init_check, dc_normal_diff, dc_div_diff, DC0, DC125, DC25, DC50, DC100, DC200, TIA_ch1, TIA_ch2;
//DC0 calculation with initial TIA gain and LED current
agc_DC0_cal_t DC0_cal, DC0_cal_div;
//AGC final LED current and TIA gains
uint16_t DC0_LEDcurrent[SLOT_NUM]={0},TIA_ch1_i[SLOT_NUM]={0},TIA_ch2_i[SLOT_NUM]={0};
//Backup initial TIA Gain
uint16_t gAFE_Trim[SLOT_NUM] = {0};
//No. of LED drivers used per slot
uint8_t gNum_led_drivers[SLOT_NUM] = {0};
agc_data_avg_t avg_data, gain_factor;

#ifdef TEST_AGC
uint16_t gAFE_Trim_init[SLOT_NUM] = {0};
uint16_t gInteg_offset[SLOT_NUM] = {0};
uint16_t gInteg_offset_init[SLOT_NUM] = {0};
uint16_t gLedCurrInit[SLOT_NUM][2] = {0};
#endif
/*--------------------------- Private Function Prototype ---------------------*/
void set_led_current(uint16_t *current);
void do_average (agc_data_avg_t *avg_data);
void calculate_DC0(agc_DC0_cal_t *DC0_cal);
void set_TIA_gain(uint16_t *slot_ch1_i, uint16_t *slot_ch2_i);

