ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/agc.c
/************************************************************************/
/* ----// LED Driver Current Max Limit //----
*
* If num_driver == 1:
*     led_curr_val <= 127 (200 mA)
*
* If num_driver >= 2:
*     led_curr_val <= 254 (400 mA)
*
* ----// ------------------------------// ----
*/

/* NOTE: Below Integrator offset value to be updated - for now keeping default
   values at each TIA gain for each of the wavelengths */

/* 
  Integrator offset at different TIA gains for each of the wavelengths,
  to align zero-crossing of BPF ouput response with integerator sequence
  to improve SNR 
*/

/* Red LED - Integrator offset register val for {phase-1, phase2} chip */
const uint16_t r_integ_offset_reg_val[NUM_TIA_GAINS][2] = {
  {0x1010, 0x0210}, /* 16500ns at 200k */
  {0x1010, 0x0210}, /* 16500ns at 100k */
  {0x1010, 0x0210}, /* 16500ns at 50k */
  {0x1010, 0x0210}, /* 16500ns at 25k */
  {0x1010, 0x0210} /* 16500ns at 12.5k */
};

/* IR LED - Integrator offset register val for {phase-1, phase2} chip */
const uint16_t ir_integ_offset_reg_val[NUM_TIA_GAINS][2] = {
  {0x1010, 0x0210}, /* 16500ns at 200k */
  {0x1010, 0x0210}, /* 16500ns at 100k */
  {0x1010, 0x0210}, /* 16500ns at 50k */
  {0x1010, 0x0210}, /* 16500ns at 25k */
  {0x1010, 0x0210} /* 16500ns at 12.5k */ 
};

/* Green LED - Integrator offset register val for {phase-1, phase2} chip */
const uint16_t g_integ_offset_reg_val[NUM_TIA_GAINS][2] = {
  {0x1010, 0x0210}, /* 16500ns at 200k */
  {0x1010, 0x0210}, /* 16500ns at 100k */
  {0x1010, 0x0210}, /* 16500ns at 50k */
  {0x1010, 0x0210}, /* 16500ns at 25k */
  {0x1010, 0x0210} /* 16500ns at 12.5k */
};

/* Blue LED integ. offeset for optimal zero crossing not avail.
Hence, setting same Integ offset for all the diff. TIA gains */
const uint16_t b_integ_offset_reg_val[NUM_TIA_GAINS][2] = {
  {0x1010, 0x0210}, /* 16500ns at 200k */
  {0x1010, 0x0210}, /* 16500ns at 100k */
  {0x1010, 0x0210}, /* 16500ns at 50k */
  {0x1010, 0x0210}, /* 16500ns at 25k */
  {0x1010, 0x0210} /* 16500ns at 12.5k */
};

/************************************************************************/

//LUT to convert from phase2 index to phase1 index ; index is ADPD4100
/* AGC algorithm calculates LED current reg setting for ADPD4100
   LUT mapping is required for ADPD4000 register setting
   To be applied, if ADPD4000 is present in Watch
   LUT contains phase1(ADPD4000) reg val corresponding to phase2(ADPD4100) reg val as index */
const uint8_t gan_lut_phase1_reg[128] =
{
0 ,
2 ,
4 ,
5 ,
7 ,
9 ,
11 ,
12 ,
14 ,
16 ,
17 ,
18 ,
19 ,
20 ,
21 ,
22 ,
22 ,
24 ,
24 ,
26 ,
26 ,
27 ,
28 ,
29 ,
30 ,
31 ,
32 ,
33 ,
34 ,
35 ,
36 ,
37 ,
38 ,
39 ,
40 ,
41 ,
42 ,
43 ,
43 ,
44 ,
45 ,
46 ,
47 ,
48 ,
49 ,
50 ,
51 ,
52 ,
53 ,
54 ,
55 ,
56 ,
56 ,
58 ,
58 ,
59 ,
60 ,
61 ,
62 ,
63 ,
64 ,
65 ,
66 ,
67 ,
69 ,
70 ,
71 ,
72 ,
73 ,
74 ,
74 ,
75 ,
76 ,
77 ,
78 ,
79 ,
80 ,
81 ,
82 ,
83 ,
83 ,
85 ,
85 ,
87 ,
87 ,
88 ,
89 ,
90 ,
91 ,
92 ,
93 ,
94 ,
95 ,
96 ,
96 ,
97 ,
99 ,
100,
101,
102,
103,
104,
105,
105,
106,
107,
108,
109,
110,
111,
111,
112,
113,
114,
115,
115,
116,
117,
118,
119,
120,
121,
122,
123,
124,
125,
126,
127,
};

/*!***************************************************************************
*
*  \brief       Setting Integrator offset
*
*  \param[in]   slot_id: specify slot idx (0 to 12 -> A to L)
*
*  \param[in]   tia_gain_idx: specify TIA gain idx (0 to 4 -> 200k to 12.5k)
*
*  \return      None
*****************************************************************************/
void set_integ_offset(uint8_t slot_id, uint8_t tia_gain_idx)
{
  g_agc_reg_base = slot_id * ADPD400x_SLOT_BASE_ADDR_DIFF;
  /* if dvt2 = 1 -> set integ offset for phase2 chip else phase1 chip */
  if(gn_led_slot_g & (1 << slot_id))
  {
    Adpd400xDrvRegWrite(ADPD400x_REG_INTEG_OFFSET_A + g_agc_reg_base, g_integ_offset_reg_val[tia_gain_idx][dvt2]);
  }
  else if(gn_led_slot_r & (1 << slot_id))
  {
    Adpd400xDrvRegWrite(ADPD400x_REG_INTEG_OFFSET_A + g_agc_reg_base, r_integ_offset_reg_val[tia_gain_idx][dvt2]);
  }
  else if(gn_led_slot_ir & (1 << slot_id))
  {
    Adpd400xDrvRegWrite(ADPD400x_REG_INTEG_OFFSET_A + g_agc_reg_base, ir_integ_offset_reg_val[tia_gain_idx][dvt2]);
  }
  else if(gn_led_slot_b & (1 << slot_id))
  {
    Adpd400xDrvRegWrite(ADPD400x_REG_INTEG_OFFSET_A + g_agc_reg_base, b_integ_offset_reg_val[tia_gain_idx][dvt2]);
  }
}

/*!****************************************************************************
*
*  \brief       Static AGC processing
*
*  \return       None
*****************************************************************************/
void agc_data_process() {

  Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE);
  memset(&avg_data, 0x00, sizeof(avg_data));
  // Find average of each slot data
  do_average(&avg_data);

  // Find TIA gain and LED current of each slot
  calculate_DC0(&DC0_cal);

  //Apply AGC final LED current settings
  set_led_current(&DC0_LEDcurrent[0]);

  //Apply AGC final TIA gain settings
  set_TIA_gain(&TIA_ch1_i[0], &TIA_ch2_i[0]);

  Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE);

}

/*!****************************************************************************
*
*  \brief       Setting LED current
*
*  \param[in]   current: pointer to set the final AGC LED current settings
*
*  \return       None
*****************************************************************************/
void set_led_current(uint16_t *current) {
  static uint16_t nRegValue = 0x0000;
  uint16_t total_led_current = 0, led_curr_per_driver = 0;
  uint8_t i, num_drivers = 0;
  uint8_t lut_index[SLOT_NUM]={0};
  static uint8_t new_reg_val[SLOT_NUM];

  //Check if its phase1 chip, if so do corresponding mapping from LUT
  if(!dvt2)
  {
    for(i=0; i <= gHighestSlotActive; i++)
    {
      if (gn_agc_active_slots & (0x01 << i)){	
        lut_index[i] = current[i];
        new_reg_val[i] =  gan_lut_phase1_reg[ lut_index[i] ];
        NRF_LOG_INFO("LED Slot:%d lut_index:%d current[0]:%d lut val:%d", i, lut_index[i], current[i], gan_lut_phase1_reg[ lut_index[i] ]);
      }
    }
  }
  else
  {
    for(i=0; i <= gHighestSlotActive; i++)
    {
      if (gn_agc_active_slots & (0x01 << i)){	
        new_reg_val[i] = current[i];
      }
    }
  }

if(gn_agc_active_slots != 0)
  {
    for(int slot = 0; slot <= gHighestSlotActive; slot++){
      if (gn_agc_active_slots & (0x01 << slot))
      {
        total_led_current = new_reg_val[slot];
        num_drivers = gNum_led_drivers[slot];
        if(num_drivers == 0)
        {
          return;
        }
        led_curr_per_driver = total_led_current / num_drivers;
        g_agc_reg_base = slot * ADPD400x_SLOT_BASE_ADDR_DIFF;

