ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/agc.c
        /*Led current setting for LED1A or LED1B */
        Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, &nRegValue);
        if((nRegValue & BITM_LED_POW12_X_LED_CURRENT1_X) != 0){
          if(num_drivers == 1)
          {
            led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
          }
          nRegValue = nRegValue & (~BITM_LED_POW12_X_LED_CURRENT1_X);
          nRegValue |= led_curr_per_driver << BITP_LED_POW12_X_LED_CURRENT1_X;
          Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, nRegValue);
          num_drivers--;
        }

        /*Led current setting for LED2A or LED2B */
        Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, &nRegValue);
        if((nRegValue & BITM_LED_POW12_X_LED_CURRENT2_X) != 0){
          if(num_drivers == 1)
          {
            led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
          }
          nRegValue = nRegValue & (~BITM_LED_POW12_X_LED_CURRENT2_X);
          nRegValue |= led_curr_per_driver << BITP_LED_POW12_X_LED_CURRENT2_X;
          Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, nRegValue);
          num_drivers--;
        }

        /*Led current setting for LED3A or LED3B */
        Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, &nRegValue); 
        if((nRegValue & BITM_LED_POW34_X_LED_CURRENT3_X) != 0){
          if(num_drivers == 1)
          {
            led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
          }
          nRegValue = nRegValue & (~BITM_LED_POW34_X_LED_CURRENT3_X);
          nRegValue |= led_curr_per_driver << BITP_LED_POW34_X_LED_CURRENT3_X;
          Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, nRegValue);
          num_drivers--;
        }

        /*Led current setting for LED4A or LED4B */
        Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, &nRegValue); 
        if((nRegValue & BITM_LED_POW34_X_LED_CURRENT4_X) != 0){
          if(num_drivers == 1)
          {
            led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
          }
          nRegValue = nRegValue & (~BITM_LED_POW34_X_LED_CURRENT4_X);
          nRegValue |= led_curr_per_driver << BITP_LED_POW34_X_LED_CURRENT4_X;
          Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, nRegValue);
          num_drivers--;
        }      
      }
    }
 }
}

/*!****************************************************************************
*
*  \brief       Setting TIA gain
*
*  \param[in]   slot_ch1_i: pointer to set the final TIA gain settings for ch1
*
*  \param[in]   slot_ch2_i: pointer to set the final TIA gain settings for ch2
*
*  \return       None
*****************************************************************************/
void set_TIA_gain(uint16_t *slot_ch1_i, uint16_t *slot_ch2_i){
  uint16_t nTIAgain = 0x0000;
  uint16_t nTsCtrl = 0x0000;
  uint8_t nCh2Enable = 0x00;
  uint8_t nTiaGainIdx = 0x00; /* Find idx of Min(CH1_TIA_GAIN, CH2_TIA_GAIN) */
  if(gn_agc_active_slots != 0)
   {
    for(int slot = 0; slot <= gHighestSlotActive; slot++){
      if (gn_agc_active_slots & (0x01 << slot))
      { 
        g_agc_reg_base = slot * ADPD400x_SLOT_BASE_ADDR_DIFF;
        /* check if ch2 is enabled */
        Adpd400xDrvRegRead(ADPD400x_REG_TS_CTRL_A + g_agc_reg_base, &nTsCtrl);
        nCh2Enable = (nTsCtrl & BITM_TS_CTRL_A_CH2_EN_A) >> BITP_TS_CTRL_A_CH2_EN_A;

        Adpd400xDrvRegRead(ADPD400x_REG_AFE_TRIM_A + g_agc_reg_base, &nTIAgain);
        nTIAgain = nTIAgain & (~BITM_AFE_TRIM_X_TIA_GAIN_CH1_X);
        nTIAgain |= (slot_ch1_i[slot]) << BITP_AFE_TRIM_X_TIA_GAIN_CH1_X;
        if(nCh2Enable)
        {
          nTIAgain = nTIAgain & (~BITM_AFE_TRIM_X_TIA_GAIN_CH2_X);
          nTIAgain |= (slot_ch2_i[slot]) << BITP_AFE_TRIM_X_TIA_GAIN_CH2_X;
        }
        else
        {
          /* if ch2 not enabled - restore default value */
          nTIAgain = nTIAgain & (~BITM_AFE_TRIM_X_TIA_GAIN_CH2_X);
          nTIAgain |= gAFE_Trim[slot] & BITM_AFE_TRIM_X_TIA_GAIN_CH2_X;
        }
        Adpd400xDrvRegWrite(ADPD400x_REG_AFE_TRIM_A + g_agc_reg_base, nTIAgain);
        if(nCh2Enable)
        {
          /* get idx of lowest gain among ch1 and ch2,
          higher the gain idx, lower will be the gain value */
          nTiaGainIdx = (slot_ch1_i[slot] >= slot_ch2_i[slot]) ? slot_ch1_i[slot] : slot_ch2_i[slot];
          /* set the integrator offset as per TIA gain */
          set_integ_offset(slot, nTiaGainIdx);
        }
        else
        {
          /* set the integrator offset as per TIA gain */
          set_integ_offset(slot, slot_ch1_i[slot]);
        }
#ifdef TEST_AGC
        /* read the integrator offset */
        Adpd400xDrvRegRead(ADPD400x_REG_INTEG_OFFSET_A + g_agc_reg_base, &gInteg_offset[slot]);
#endif
      }
    }
  }
}

/*!***************************************************************************
*
*  \brief       Get the count of LED drivers enabled for the slot specified
*
*  \param[in]   slot_id: specify slot idx (0 to 12 -> A to L)
*
*  \return      None
*****************************************************************************/
void get_led_drv_count(uint8_t slot_id)
{
    uint16_t nRegValue = 0x0000;
    g_agc_reg_base = slot_id * ADPD400x_SLOT_BASE_ADDR_DIFF;

    /* check if LED1A or LED1B enabled */
    Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, &nRegValue);
    if((nRegValue & BITM_LED_POW12_X_LED_CURRENT1_X) != 0){
    gNum_led_drivers[slot_id]++;
    }

    /* check if LED2A or LED2B enabled */
    Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, &nRegValue);
    if((nRegValue & BITM_LED_POW12_X_LED_CURRENT2_X) != 0){
    gNum_led_drivers[slot_id]++;
    }

    /* check if LED3A or LED3B enabled */
    Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, &nRegValue); 
    if((nRegValue & BITM_LED_POW34_X_LED_CURRENT3_X) != 0){
    gNum_led_drivers[slot_id]++;
    }
         
    /* check if LED4A or LED4B enabled */
    Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, &nRegValue); 
    if((nRegValue & BITM_LED_POW34_X_LED_CURRENT4_X) != 0){
    gNum_led_drivers[slot_id]++;
    }
}
/*!****************************************************************************
*
*  \brief       Static AGC initialization
*
*  \return       None
*****************************************************************************/
void agc_init() {
  uint16_t nRegValue = 0x0000;
  uint16_t nLedCurrent = INIT_AGCLED_PHASE2;
  uint16_t adpdFreq;
  uint16_t total_led_current = 0, led_curr_per_driver = 0;
  uint8_t num_drivers = 0;
  
