ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/agc.c
  /* Highest active slot */
  Adpd400xDrvGetParameter(ADPD400x_HIGHEST_SLOT_NUM, 0, &gHighestSlotActive);

  //Check if its phase1 chip and set corresponding INIT_AGCLED
  if(!dvt2)
  {
    nLedCurrent = INIT_AGCLED_PHASE1;
    Init_gain = INIT_TIA_GAIN_PHASE1;
  }
  
  memset(&agc_data[0], 0x00, sizeof(agc_data));
  memset(&avg_data, 0x00, sizeof(avg_data));
  memset(&DC0_init_check, 0x00, sizeof(DC0_init_check));
  memset(&dc_normal_diff, 0x00, sizeof(dc_normal_diff));
  memset(&dc_div_diff , 0x00, sizeof(dc_div_diff));
  memset(&DC0 , 0x00, sizeof(DC0));
  memset(&DC125 , 0x00, sizeof(DC125));
  memset(&DC25 , 0x00, sizeof(DC25));
  memset(&DC50 , 0x00, sizeof(DC50));
  memset(&DC100 , 0x00, sizeof(DC100));
  memset(&DC200 , 0x00, sizeof(DC200));
  memset(&TIA_ch1 , 0x00, sizeof(TIA_ch1));
  memset(&TIA_ch2 , 0x00, sizeof(TIA_ch2));
  memset(&TIA_ch1_i[0], 0x00, sizeof(TIA_ch1_i));
  memset(&TIA_ch2_i[0], 0x00, sizeof(TIA_ch2_i));
  memset(&DC0_LEDcurrent[0], 0x00, sizeof(DC0_LEDcurrent));
  memset(&gain_factor, 0x00, sizeof(gain_factor));
  memset(&DC0_cal, 0x00,sizeof(DC0_cal));
  memset(&DC0_cal_div, 0x00, sizeof(DC0_cal_div));
  memset(&FullScale[0],0x00, sizeof(FullScale));
  memset(&gAFE_Trim[0], 0x00, sizeof(gAFE_Trim));
  memset(&gNum_led_drivers[0], 0x00, sizeof(gNum_led_drivers));
#ifdef TEST_AGC
  memset(&gAFE_Trim_init[0], 0x00, sizeof(gAFE_Trim_init));
  memset(&gInteg_offset[0], 0x00, sizeof(gInteg_offset));
  memset(&gInteg_offset_init[0], 0x00, sizeof(gInteg_offset_init));
#endif

#ifdef ENABLE_PPG_APP
if(Ppg_Slot != 0)
  {
  Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE);
  hrmInputRate = gAdpd400x_lcfg->hrmInputRate;
  if(hrmInputRate == 0x1F4 )     //500Hz
    adpdFreq = 0x07D0;
  else if(hrmInputRate == 0x64 ) //100Hz
    adpdFreq = 0x2710;
  else                           //50Hz
    adpdFreq = 0x4e20;
#ifndef SLOT_SELECT
  Adpd400xDrvRegWrite(0x000D, adpdFreq); /*TODO: handle slot switching case */
#endif
  Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE);
  }
#endif

if(gn_agc_active_slots != 0){ 
  for(int slot = 0; slot <= gHighestSlotActive; slot++){
    if (gn_agc_active_slots & (0x01 << slot)){ 
      g_agc_reg_base = slot * ADPD400x_SLOT_BASE_ADDR_DIFF;
      Adpd400xDrvRegRead(ADPD400x_REG_COUNTS_A + g_agc_reg_base, &SlotRegisters.pulse[slot]);
      SlotRegisters.pulse[slot] = (SlotRegisters.pulse[slot] & 0x00FF);
      FullScale[slot] = SlotRegisters.pulse[slot] * 8192;

      /* take backup of default TIA gain set in the DCFG */
      Adpd400xDrvRegRead(ADPD400x_REG_AFE_TRIM_A + g_agc_reg_base, &gAFE_Trim[slot]);
      /* set initial TIA gain for agc */
      Adpd400xDrvRegRead(ADPD400x_REG_AFE_TRIM_A + g_agc_reg_base, &nRegValue);
      nRegValue = nRegValue & (~BITM_AFE_TRIM_X_TIA_GAIN_CH1_X);
      nRegValue |= (Init_gain & BITM_AFE_TRIM_X_TIA_GAIN_CH1_X);
      nRegValue = nRegValue & (~BITM_AFE_TRIM_X_TIA_GAIN_CH2_X);
      nRegValue |= (Init_gain & BITM_AFE_TRIM_X_TIA_GAIN_CH2_X);
      Adpd400xDrvRegWrite(ADPD400x_REG_AFE_TRIM_A + g_agc_reg_base, nRegValue);
      /* set the integrator offset as per TIA gain */
      set_integ_offset(slot, Init_gain & BITM_AFE_TRIM_X_TIA_GAIN_CH1_X);/* ch1 and ch2 TIA gain is same */

#ifdef TEST_AGC
      /* take backup of TIA gain set during Init */
      Adpd400xDrvRegRead(ADPD400x_REG_AFE_TRIM_A + g_agc_reg_base, &gAFE_Trim_init[slot]);
      /* take backup of Integrator offset set during Init */
      Adpd400xDrvRegRead(ADPD400x_REG_INTEG_OFFSET_A + g_agc_reg_base, &gInteg_offset_init[slot]);
#endif
      /* get the count of led drivers enabled per slot */
      get_led_drv_count(slot);
      total_led_current = nLedCurrent;
      num_drivers = gNum_led_drivers[slot];
      if(num_drivers == 0)
      {
        return;
      }
      led_curr_per_driver = total_led_current/ num_drivers;

      /*Led current setting for LED1A or LED1B */
      Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, &nRegValue);
      if((nRegValue & BITM_LED_POW12_X_LED_CURRENT1_X) != 0){
        if(num_drivers == 1)
        {
          led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
        }
        nRegValue = nRegValue & (~BITM_LED_POW12_X_LED_CURRENT1_X);
        nRegValue |= (led_curr_per_driver) << BITP_LED_POW12_X_LED_CURRENT1_X;
        Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, nRegValue);
        num_drivers--;
      }
      /*Led current setting for LED2A or LED2B */
      Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, &nRegValue);
      if((nRegValue & BITM_LED_POW12_X_LED_CURRENT2_X) != 0){
        if(num_drivers == 1)
        {
          led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
        }
        nRegValue = nRegValue & (~BITM_LED_POW12_X_LED_CURRENT2_X);
        nRegValue |= (led_curr_per_driver) << BITP_LED_POW12_X_LED_CURRENT2_X;
        Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, nRegValue);
        num_drivers--;
      }
      /*Led current setting for LED3A or LED3B */
      Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, &nRegValue);
      if((nRegValue & BITM_LED_POW34_X_LED_CURRENT3_X) != 0){
        if(num_drivers == 1)
        {
          led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
        }
        nRegValue = nRegValue & (~BITM_LED_POW34_X_LED_CURRENT3_X);
        nRegValue |= (led_curr_per_driver) << BITP_LED_POW34_X_LED_CURRENT3_X;
        Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, nRegValue);
        num_drivers--;
      }      
      /*Led current setting for LED4A or LED4B */
      Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, &nRegValue);
      if((nRegValue & BITM_LED_POW34_X_LED_CURRENT4_X) != 0){
        if(num_drivers == 1)
        {
          led_curr_per_driver = total_led_current - ((gNum_led_drivers[slot] - 1) * led_curr_per_driver);
        }
        nRegValue = nRegValue & (~BITM_LED_POW34_X_LED_CURRENT4_X);
        nRegValue |= (led_curr_per_driver) << BITP_LED_POW34_X_LED_CURRENT4_X;
        Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, nRegValue);
        num_drivers--;
      }
#ifdef TEST_AGC
     Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_agc_reg_base, &gLedCurrInit[slot][0]);
     Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_agc_reg_base, &gLedCurrInit[slot][1]); 
#endif
    }
  }
 }
}

/*!****************************************************************************
*
*  \brief       Static AGC deinitialization
*
*  \return       None
*****************************************************************************/
void agc_deinit(void)
{
  gn_agc_active_slots = 0;
  //ReLoad register settings after AGC, to default for ppg application
}

/*!****************************************************************************
*
*  \brief       Calculate average of each slot data
*
*  \param[in]   avg_data: pointer to get average of each channel of each slot
*
*  \return       None
*****************************************************************************/
void do_average (agc_data_avg_t *avg_data) {
  for (uint8_t slot = 0; slot <= gHighestSlotActive ; slot++) {
    if (gn_agc_active_slots & (0x01 << slot)){
      for (uint8_t sample = 0; sample < SAMPLE_AVG_NUM ; sample++) {
        avg_data->ch1[slot] = avg_data->ch1[slot] + agc_data[slot].ch1[sample];
        avg_data->ch2[slot] = avg_data->ch2[slot] + agc_data[slot].ch2[sample];
      }
    }
  }

