ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/agc.c
  for(uint8_t slot = 0; slot <= gHighestSlotActive; slot++) {
    if (gn_agc_active_slots & (0x01 << slot)){
      avg_data->ch1[slot] = avg_data->ch1[slot] / SAMPLE_AVG_NUM;
      avg_data->ch2[slot] = avg_data->ch2[slot] / SAMPLE_AVG_NUM;
    }
  }
}

/*!****************************************************************************
*
*  \brief       Find TIA gain and LED current of each slot
*
*  \param[in]   DC0_cal: pointer to get the average of each slot
*
*  \return       None
*****************************************************************************/
void calculate_DC0(agc_DC0_cal_t *DC0_cal){
  uint16_t mul_factor = 0x0000;
  for(uint8_t slot = 0; slot <= gHighestSlotActive ; slot++){
   if (gn_agc_active_slots & (0x01 << slot)){
    DC0_cal->ch1[slot] = ((avg_data.ch1[slot]*100)/(float) FullScale[slot]);
    DC0_cal->ch2[slot] = ((avg_data.ch2[slot]*100)/(float) FullScale[slot]);
    if(DC0_cal->ch1[slot]> DC0_cal->ch2[slot]){
      DC0_init_check.ch[slot] = DC0_cal->ch1[slot];
      DC0.ch[slot] = DC0_cal->ch1[slot];
    }
    else{
      DC0_init_check.ch[slot] = DC0_cal->ch2[slot];
      DC0.ch[slot] = DC0_cal->ch2[slot];
    }
    /* In case no. of active led driver is more than 1, 
           - use multiplication factor corresponding to max current of 400mA, 
       else 
           - use multiplication factor corresponding to max current of 200mA 
    */
    mul_factor = (gNum_led_drivers[slot] > 1) ? MAX_AMP_FACTOR_400MA : MAX_AMP_FACTOR_200MA;
    if((DC0_init_check.ch[slot] * mul_factor)<70){
      TIA_ch1_i[slot] = 0;
      TIA_ch2_i[slot] = 0;
      DC0_LEDcurrent[slot] = (gNum_led_drivers[slot] > 1) ? MAX_400MA_LED_REG_VAL : MAX_200MA_LED_REG_VAL;
    }
    else{
       if(DC0_cal->ch1[slot]> DC0_cal->ch2[slot]){
        if(DC0_cal->ch1[slot] < (2*DC0_cal->ch2[slot])){
          gain_factor.ch1[slot] = 1;
          gain_factor.ch2[slot] = 1;
        }
        else if((DC0_cal->ch1[slot] >= (2*DC0_cal->ch2[slot])) && (DC0_cal->ch1[slot] <= (4*DC0_cal->ch2[slot]))){
          gain_factor.ch1[slot] = 1;
          gain_factor.ch2[slot] = 2;
        }
        else{
          if(DC0_cal->ch1[slot]>= (4*DC0_cal->ch2[slot])){
            gain_factor.ch1[slot] = 1;
            gain_factor.ch2[slot] = 4;
          }
        }
      }
      else{
          if(DC0_cal->ch2[slot] < (2*DC0_cal->ch1[slot])){
          gain_factor.ch1[slot] = 1;
          gain_factor.ch2[slot] = 1;
        }
        else if((DC0_cal->ch2[slot] >= (2*DC0_cal->ch1[slot])) && (DC0_cal->ch2[slot] <= (4*DC0_cal->ch1[slot]))){
          gain_factor.ch1[slot] = 2;
          gain_factor.ch2[slot] = 1;
        }
        else{
          if(DC0_cal->ch2[slot]>= (4*DC0_cal->ch1[slot])){
            gain_factor.ch1[slot] = 4;
            gain_factor.ch2[slot] = 1;
          }
        }
      }

      DC125.ch[slot] = DC0.ch[slot]*12.5;
      DC25.ch[slot] = DC125.ch[slot]*2;
      DC50.ch[slot] = DC25.ch[slot]*2;
      DC100.ch[slot] = DC50.ch[slot]*2;
      DC200.ch[slot] = DC100.ch[slot]*2;
      if((gn_led_slot_r & (0x01 << slot)) || (gn_led_slot_ir & (0x01 << slot)))
      {
        if(DC125.ch[slot]>=70){
          DC0_LEDcurrent[slot] = (uint16_t)((70/(DC0.ch[slot]/8)));
          if(gain_factor.ch1[slot] >= 3){
            gain_factor.ch1[slot] = 2;
          }
          if(gain_factor.ch2[slot] >= 3){
            gain_factor.ch2[slot] = 2;
          }
          TIA_ch1.ch[slot] = (float)(12.5 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] = (float)(12.5 * gain_factor.ch2[slot]);
        }
        else if(DC25.ch[slot]>=70){
          DC0_LEDcurrent[slot] =(uint16_t)((35/(DC0.ch[slot]/8)));
          TIA_ch1.ch[slot] =(float) (25 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (25 * gain_factor.ch2[slot]);
        }
        else if(DC50.ch[slot]>=70){
          DC0_LEDcurrent[slot] =(uint16_t)((17.5/(DC0.ch[slot]/8)));
          TIA_ch1.ch[slot] =(float) (50 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (50 * gain_factor.ch2[slot]);
        }
        else if(DC100.ch[slot]>=70){
          DC0_LEDcurrent[slot] =(uint16_t)((8.75/(DC0.ch[slot]/8)));
          if(gain_factor.ch1[slot] >= 3){
            gain_factor.ch1[slot] = 2;
          }
          if(gain_factor.ch2[slot] >= 3){
            gain_factor.ch2[slot] = 2;
          }
          TIA_ch1.ch[slot] =(float) (100 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (100 * gain_factor.ch2[slot]);
        }
        else{
          DC0_LEDcurrent[slot] =(uint16_t)((4.375/(DC0.ch[slot]/8)));
          if(gain_factor.ch1[slot] >= 2){
            gain_factor.ch1[slot] = 1;
          }
          if(gain_factor.ch2[slot] >= 2){
            gain_factor.ch2[slot] = 1;
          }
          TIA_ch1.ch[slot] =(float) (200 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (200 * gain_factor.ch2[slot]);
        }
        if(gNum_led_drivers[slot] > 1)
        {
           if(DC0_LEDcurrent[slot] >= MAX_400MA_LED_REG_VAL){
            DC0_LEDcurrent[slot] = MAX_400MA_LED_REG_VAL;
          }
        }
        else{
          if(DC0_LEDcurrent[slot] >= MAX_200MA_LED_REG_VAL){
            DC0_LEDcurrent[slot] = MAX_200MA_LED_REG_VAL;
          }
        }
      }
      else
      {
         if(DC125.ch[slot]>=70){
          DC0_LEDcurrent[slot] = (uint16_t)((75/(DC0.ch[slot]/8)));
          if(gain_factor.ch1[slot] >= 3){
            gain_factor.ch1[slot] = 2;
          }
          if(gain_factor.ch2[slot] >= 3){
            gain_factor.ch2[slot] = 2;
          }
          TIA_ch1.ch[slot] =(float) (12.5 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (12.5 * gain_factor.ch2[slot]);
        }
        else if(DC25.ch[slot]>=70){
          DC0_LEDcurrent[slot] =(uint16_t)((37.5/(DC0.ch[slot]/8)));
          TIA_ch1.ch[slot] =(float) (25 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (25 * gain_factor.ch2[slot]);
        }
        else if(DC50.ch[slot]>=70){
          DC0_LEDcurrent[slot] =(uint16_t)((18.75/(DC0.ch[slot]/8)));
          TIA_ch1.ch[slot] =(float) (50 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (50 * gain_factor.ch2[slot]);
        }
        else if(DC100.ch[slot]>=70){
          DC0_LEDcurrent[slot] =(uint16_t)((9.375/(DC0.ch[slot]/8)));
          if(gain_factor.ch1[slot] >= 3){
            gain_factor.ch1[slot] = 2;
          }
          if(gain_factor.ch2[slot] >= 3){
            gain_factor.ch2[slot] = 2;
          }
          TIA_ch1.ch[slot] =(float) (100 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (100 * gain_factor.ch2[slot]);
        }
        else{
          DC0_LEDcurrent[slot] =(uint16_t)((4.6875/(DC0.ch[slot]/8)));
          if(gain_factor.ch1[slot] >= 2){
            gain_factor.ch1[slot] = 1;
          }
          if(gain_factor.ch2[slot] >= 2){
            gain_factor.ch2[slot] = 1;
          }
          TIA_ch1.ch[slot] =(float) (200 * gain_factor.ch1[slot]);
          TIA_ch2.ch[slot] =(float) (200 * gain_factor.ch2[slot]);
        }
        if(gNum_led_drivers[slot] > 1)
        {
           if(DC0_LEDcurrent[slot] >= MAX_400MA_LED_REG_VAL){
            DC0_LEDcurrent[slot] = MAX_400MA_LED_REG_VAL;
          }
        }
        else{
          if(DC0_LEDcurrent[slot] >= MAX_200MA_LED_REG_VAL){
            DC0_LEDcurrent[slot] = MAX_200MA_LED_REG_VAL;
          }
        }
      }

      //CH1
      if(TIA_ch1.ch[slot]==12.5){
        TIA_ch1_i[slot]=4;
      }
      else if(TIA_ch1.ch[slot]==25){
        TIA_ch1_i[slot]=3;
      }
      else if(TIA_ch1.ch[slot]==50){
        TIA_ch1_i[slot]=2;
      }
      else if(TIA_ch1.ch[slot]==100){
        TIA_ch1_i[slot]=1;
      }
      else {
        TIA_ch1_i[slot]=0;
      }

      //CH2
      if(TIA_ch2.ch[slot]==12.5){
        TIA_ch2_i[slot]=4;
      }
      else if(TIA_ch2.ch[slot]==25){
        TIA_ch2_i[slot]=3;
      }
      else if(TIA_ch2.ch[slot]==50){
        TIA_ch2_i[slot]=2;
      }
      else if(TIA_ch2.ch[slot]==100){
        TIA_ch2_i[slot]=1;
      }
      else if(TIA_ch2.ch[slot]==200){
        TIA_ch2_i[slot]=0;
      }
    }
   }
 }
}

/*!****************************************************************************
*
*  \brief       Get static agc information
*
*  \param[in]   agc_info: pointer to get static agc information
*
*  \return       None
*****************************************************************************/
void get_agc_info(m2m2_adpd_agc_info_t *agc_info)
{
  int i;

  /* (led_index-1) is used since the CLI and tools use the indices
     1 -> LED 1 -> Green
     2 -> LED 2 -> Red
     3 -> LED 3 -> IR
     4 -> LED 4 -> Blue
  */
  for( i=0; i<SAMPLE_AVG_NUM; i++ )
  {
    agc_info->led_ch1[i] = agc_data[agc_info->led_index-1].ch1[i];
    agc_info->led_ch2[i] = agc_data[agc_info->led_index-1].ch2[i];
  }

  agc_info->DC0_LEDcurrent = DC0_LEDcurrent[agc_info->led_index-1];
  agc_info->TIA_ch1_i = TIA_ch1_i[agc_info->led_index-1];
  agc_info->TIA_ch2_i = TIA_ch2_i[agc_info->led_index-1];
}